<template>

        <div class="mswarp bg-wh" style="padding-top: 50px; padding-bottom: 50px !important;">
    <!--合约头部部分-->
            <XheaderRgt status="contract" />
    <!--合约正文部分-->
            <div>
                <div id="contentlist" class="mscontent jeflex detailbox">
                    <div class="p15 f13 g6">
                        <h3 class="b tc f18 g3">洋葱OMALL平台用户服务协议</h3>
                        <p class="b f14 mt20 g3">【提示条款】</p>
                        <p class="mt5">　　欢迎您与洋葱OMALL平台签署本《洋葱OMALL平台用户服务协议》（下称“本协议”）并使用洋葱OMALL平台服务！</p>
                        <p class="mt15">　　自本协议发布之日起，洋葱OMALL平台各处所称”洋葱OMALL服务协议”均指本协议。</p>
                        <p class="mt5">　　各服务条款前所列索引关键词仅为帮助您理解该条款表达的主旨之用，不影响或限制本协议条款的含义或解释。为维护您自身权益，建议您仔细阅读各条款具体表述。</p>
                        <p class="mt15"><span class="b g3">【审慎阅读】</span>您在洋葱OMALL平台注册/登录时点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。如您对协议有任何疑问，可向洋葱OMALL平台客服咨询。</p>
                        <p class="mt5"><span class="b g3">【签约动作】</span>当您按照在注册时，勾选阅读并同意本协议后，即表示您已充分阅读、理解并接受本协议的全部内容，并与洋葱OMALL达成一致，使用洋葱OMALL平台购买商品。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止使用。</p>
                        <p class="b f15 mt20 g3">第一条　 定义</p>
                        <p class="b g3 mt10">两棵树网站：指由广州市两棵树网络科技有限公司开发、运营、提供技术支持和服务的网站，网址：http://www.msyc.cc； http://www.msyc.com；https://m.msyc.cc。</p>
                        <p class="mt5"><span class="b g3">洋葱OMALL平台：</span>指运行于两棵树网站的开放平台，是两棵树网站上的电子商务交易服务平台。</p>
                        <p class="mt5"><span class="b g3">洋葱OMALL平台服务：</span>基于互联网，以包含洋葱OMALL平台网站、客户端等在内的各种形态（包括未来技术发展出现的新的服务形态向您提供的各项服务）。</p>
                        <p class="mt5"><span class="b g3">洋葱OMALL平台规则：</span>指由平台运营方不时发布或/及公示在洋葱商城之上的规则，包括在所有洋葱OMALL平台各频道内已经发布及后续发布的全部规则、解读、公告等内容以及洋葱商学院各类规则、实施细则、产品流程说明、公告等。</p>
                        <p class="mt5"><span class="b g3">服务商：</span>指向所负责服务商提供服务商端口及相关服务及向终端服务商提供终端端口并提供相关服务的第三方自然人或公司/机构。</p>
                        <p class="mt5"><span class="b g3">终端服务商：</span>即通过终端端口为洋葱商城平台上的消费者提供服务的自然人或公司/机构。</p>
                        <p class="mt5"><span class="b g3">会员: </span>指已在洋葱OMALL平台成功完成注册的自然人。 </p>
                        <p class="b f15 mt20 g3">第二条　账户注册与使用</p>
                        <p class="b mt10 f14 g3">2.1、会员资格</p>
                        <p class="mt5">　　您确认，在您开始注册使用洋葱OMALL平台服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，您及您的监护人将依照法律规定承担相关法律责任及相关后果。</p>
                        <p class="mt5">　　此外，您还需确保您不是任何国家、国际组织或者地域实施的贸易限制、制裁或其他法律、规则限制的对象，否则您可能无法正常注册及使用洋葱OMALL平台服务。</p>
                        <p class="b mt10 f14 g3">2.2、账户说明</p>
                        <p class="mt5"><span class="b g3">【账户获得】</span>当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，您可获得洋葱OMALL平台账户并成为洋葱OMALL平台会员。</p>
                        <p class="mt5">　　注册成为洋葱OMALL会员时，您将分配至您在洋葱OMALL所属的终端服务商，您可选择自行订购或通过终端服务商推广而订购洋葱OMALL平台上的商品；</p>
                        <p class="mt5">　　洋葱OMALL平台每位会员均需按照页面提示填写并如实提供相关信息方可使用平台服务，同时洋葱OMALL只允许同一会员使用一个洋葱OMALL平台账户。如有证据证明或洋葱OMALL根据平台规则判定存在不当注册或不当使用多个洋葱OMALL平台账户的情形，洋葱OMALL平台可采取冻结或关闭账户、取消订单、拒绝提供服务等措施，如给洋葱OMALL平台及相关方造成损失的，您还应承担赔偿责任。</p>
                        <p class="mt5"><span class="b g3">【账户使用】</span>您随时设置的密码（账户名称及密码合称”账户”）登录洋葱OMALL平台。</p>
                        <p class="mt5">由于您的洋葱OMALL账户关联您的个人信息及洋葱OMALL平台商业信息，您的洋葱OMALL账户仅限您本人使用。未经洋葱OMALL平台同意，您直接或间接授权第三方使用您洋葱OMALL账户或获取您账户项下信息的行为无效。如洋葱OMALL根据洋葱OMALL平台规则中约定的违约认定程序及标准判断您洋葱OMALL账户的使用可能危及您的账户安全及/或洋葱OMALL平台信息安全的，洋葱OMALL平台可拒绝提供相应服务或终止本协议。</p>
                        <p class="mt5"><span class="b g3">【实名认证】</span>作为洋葱OMALL平台运营方，为使您更好地使用洋葱OMALL平台的各项服务，保障您的账户安全，将要求您按相关规定完成实名认证。</p>
                        <p class="b mt10 f14 g3">2.3、账户安全规范</p>
                        <p class="mt5"><span class="b g3">【账户安全保管义务】</span>您的账户为您自行设置并由您保管，洋葱OMALL任何时候均不会主动要求您提供您的账户密码。因此，建议您务必保管好您的账户，并确保您在每个上网时段结束时退出登录并以正确步骤离开洋葱OMALL平台。</p>
                        <p class="mt5">账户因您泄露或因您遭受他人攻击、诈骗等行为导致的损失及后果，洋葱OMALL并不承担责任，您应通过司法、行政等途径向侵权行为人追偿。</p>
                        <p class="mt5"><span class="b g3">【账户行为责任自负】</span>除洋葱OMALL存在过错外，您应对您账户项下的所有行为结果（包括但不限于在线签署各类协议、发布信息、购买商品及服务及披露信息等）负责。</p>
                        <p class="mt5"><span class="b g3">【日常维护须知】</span>如发现任何未经授权使用您账户登录洋葱OMALL平台或其他可能导致您账户遭窃、遗失的情况，建议您立即通知洋葱OMALL。您理解洋葱OMALL对您的任何请求采取行动均需要合理时间，且洋葱OMALL应您请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除洋葱OMALL存在法定过错外，洋葱OMALL无责担相关赔偿。</p>
                        <p class="b f15 mt20 g3">第三条　商品及/或服务的购买</p>
                        <p class="mt10">　　(一)、当您在洋葱OMALL平台购买商品及/或服务时，请您务必仔细确认所购商品的品名、价格、数量、型号、规格、尺寸或服务的时间、内容、限制性要求等重要事项，并在下单时核实您的联系地址、电话、收货人等信息。如您填写的收货人非您本人，则该收货人的行为和意思表示产生的法律后果均由您承担。</p>
                        <p class="mt5">　　(二)、您的购买行为应当基于真实的消费需求，不得存在对商品及/或服务实施恶意购买、恶意维权等扰乱洋葱OMALL平台正常交易秩序的行为。基于维护洋葱OMALL平台交易秩序及交易安全的需要，洋葱OMALL发现上述情形时可自主执行关闭相关交易订单等操作。</p>
                        <p class="mt5">　　(三)、如您在洋葱OMALL平台城购买商品为境外商品，该类商品适用的品质、健康、标识等商品使用标准均以符合原产国生产标准，部分商品可能与中华人民共和国使用标准有所差异，如您成功提交并支付订购后，默认已获知商品以原产国的生产标准，如使用过程中由此可能产生的危害或损失以及其他风险，将由您个人承担。</p>
                        <p class="mt5">　　(四)、如您在洋葱OMALL平台城购买商品为境外商品，根据国家跨境电商制度，不配备中国发票。</p>
                        <p class="mt5">　　(五)、如您购买属于洋葱OMALL的境外商品，品牌方提供的售后服务依据品牌方服务制度执行，由您自行与品牌方协商沟通售后服务，洋葱OMALL不予提供，包括不限于家电/电子设备保修服务，上门服务等。</p>
                        <p class="mt5">　　(六)、洋葱OMALL所有商品均由平台运营方以外的第三方进行销售。终端服务商根据消费者的需求，为消费者推荐平台上销售的产品，协助消费者购买平台的商品；管理该终端服务商所属洋葱商城的服务商提供相应洋葱虚拟端口的管理与服务。</p>
                        <p class="mt5">　　(七)、洋葱平台上所标示的商品的价格由两部分组成：(i)商品的价款，和(ii) 综合服务费（综合服务费包括：(i) 终端服务商提供相关服务收取的用户服务费，和(ii) 管理该终端服务商所属洋葱商城的服务商提供相应洋葱虚拟端口管理与服务收取的店铺服务费），具体组成比例根据洋葱平台规则规定，并可能不时调整。您在洋葱OMALL上购买商品，被视为您同意按照洋葱OMALL平台规则向销售方支付商品价款并向终端服务商、相应服务商支付综合服务费。</p>
                        <p class="mt5">　　(八)、如您在洋葱OMALL平台城购买商品为境外商品，该跨境进口产品为产地直销商品，仅限个人自用不得进行再销售，商品本身无中文标签，您可以根据洋葱OMALL展示的商品详情页信息了解商品的具体信息，包括不限于产品使用方法、产品品牌介绍等。</p>
                        <p class="mt5">　　(九)、如您在洋葱OMALL平台城购买商品为境外商品，该跨境进口产品为产地直销商品均为境外直邮商品，保税区清关的境外商品时，默认同意由洋葱OMALL代您向海关进行申报和代缴税款。</p>
                        <p class="mt5">　　(十)、如您购买属于洋葱OMALL的跨境进口产品，需依法需向中国海关申报和纳税，个人单笔订单金额不能超过人民币2000元，个人年度累计消费金额不能超过人民币2万元，否则将无法正常发货。如因您超出累计消费金额而产生的订单退货退款费用均由您承担。</p>
                        <p class="mt5">　　(十一)、如您购买属于洋葱OMALL的跨境进口产品，根据国家政策，如订单一旦提交至海关申报及纳税，您将不能修改订单信息（收货地址、收货电话、收货人等），也不能申请退款。</p>
                        <p class="b f15 mt20 g3">第四条　责任限制</p>
                        <p class="mt10"><span class="b g3">【不可抗力及第三方原因】</span>洋葱OMALL依照法律规定履行基础保障义务，但对于下述原因导致的合同履行障碍、履行瑕疵、履行延后
                            或履行内容变更等情形，洋葱OMALL并不承担相应的违约责任：</p>
                        <p class="mt5">　　（一）、因自然灾害、罢工、暴乱、战争、国际和国内政府行为、司法行政命令等不可抗力因素；</p>
                        <p class="mt5">　　（二）、因电商市场活动大促（如618，双11，美国黑色星期五等）、洋葱OMALL大促等因素；</p>
                        <p class="mt5">　　（三）、因电力供应故障、通讯网络故障等公共服务因素或第三人因素；</p>
                        <p class="mt5">　　（四）、在洋葱OMALL已尽善管理的情况下，因常规或紧急的设备与系统维护、设备与系统故障、网络信息与数据安全等因素。</p>
                        <p class="mt5"><span class="b g3">【调处决定】</span>您理解并同意，在争议调处服务中，洋葱OMALL平台的客服人员非专业人士，仅能以普通人的认知对会员提交的凭证进行判断。因此，除存在故意或重大过失外，调处方对争议调处决定免责。</p>
                        <p class="b f15 mt20 g3">第五条　会员信息的保护及授权</p>
                        <p class="b mt10 f14 g3">5.1、个人信息保护</p>
                        <p class="mt5">　　洋葱OMALL非常重视会员个人信息（即能够独立或与其他信息结合后识别会员身份的信息）的保护，在您使用洋葱OMALL提供的服务时，您同意洋葱OMALL收集、存储、使用、披露和保护您的个人信息。</p>
                        <p class="mt5">　　您同意洋葱OMALL拥有通过邮箱、短信、电话、微信等形式，向您、购物用户和收货人发送订单信息、促销活动等告知信息权利；</p>
                        <p class="b mt10 f14 g3">5.2、非个人信息的保证与授权</p>
                        <p class="mt5"><span class="b g3">【信息的发布】</span>您声明并保证，您对您所发布/上传的信息拥有相应、合法的权利。否则，洋葱OMALL可对您发布的信息依法或依本协议进行删除或屏蔽。</p>
                        <p class="mt5"><span class="b g3">【禁止性信息】</span>您应当确保您所发布的信息不包含以下内容：</p>
                        <p class="mt5">　　（一）、违反国家法律法规禁止性规定的；</p>
                        <p class="mt5">　　（二）政治宣传、封建迷信、淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；</p>
                        <p class="mt5">　　（三）、欺诈、虚假、不准确或存在误导性的；</p>　
                        <p class="mt5">　　（四）、侵犯他人知识产权或涉及第三方商业秘密及其他专有权利的；</p>
                        <p class="mt5">　　（五）、侮辱、诽谤、恐吓、涉及他人隐私等侵害他人合法权益的；</p>
                        <p class="mt5">　　（六）、存在可能破坏、篡改、删除、影响洋葱OMALL平台任何系统正常运行或未经授权秘密获取洋葱OMALL平台及其他用户的数据、个人资料的病毒、木马、爬虫等恶意软件、程序代码的；</p>
                        <p class="mt5">　　（七）、其他违背社会公共利益或公共道德或依据相关洋葱OAMLL平台协议、规则的规定不适合在洋葱OMALL平台上发布的。</p>
                        <p class="b f15 mt20 g3">第六条　协议的变更</p>
                        <p class="mt5">　　洋葱OMALL可根据国家法律法规变化及维护交易秩序、保护消费者权益需要，不时修改本协议、补充协议，变更后的协议、补充协议（下称“变更事项”）将通过法定程序并以本协议第八条约定的方式通知您。</p>
                        <p class="mt5">　　如您不同意变更事项，您有权于变更事项确定的生效日前联系洋葱OMALL客服反馈。如反馈意见得以采纳洋葱将酌情调整变更事项。如您对已生效的变更事项仍不同意的，您应当于变更事项确定的生效之日起停止使用洋葱OMALL服务；</p>
                        <p class="mt5">　　如您在变更事项生效后仍继续使用洋葱OMALL服务，则视为您同意已生效的变更事项。</p>
                        <p class="b f15 mt20 g3">第七条　通知</p>
                        <p class="mt10 g3 b f14">7.1、有效联系方式</p>
                        <p class="mt5">　　您在注册成为洋葱OMALL平台用户，并接受洋葱OMALL服务时，您应该向洋葱OMALL提供真实有效的联系方式（包括您的电子邮件地址、联系电话、联系地址等），对于联系方式发生变更的，您有义务及时更新有关信息，并保持可被联系的状态。</p>
                        <p class="mt5">　　您在注册洋葱OMALL平台用户时生成的用于登录洋葱OMALL平台接收系统消息、洋葱客户端即时通讯信息的会员账号，也作为您的有效联系方式。</p>
                        <p class="b mt5 g3">　　洋葱OMALL将向您的上述联系方式的其中之一或其中若干向您送达各类通知，而此类通知的内容可能对您的权利义务产生重大的有利或不利影响，请您务必及时关注。</p>
                        <p class="mt5">　　您有权通过您注册时填写的手机号码获取您感兴趣的商品广告信息、促销优惠等商业性信息；您如果不愿意接收此类信息，<span class="b g3">您有权通过洋葱OMALL提供的相应的退订功能进行退订。</span></p>
                        <p class="mt10 g3 b f14">7.2、通知的送达</p>
                        <p class="mt10">　　洋葱OMALL通过上述联系方式向您发出通知，其中以电子的方式发出的书面通知，包括但不限于在洋葱OMALL平台公告，向您提供的系电话发送手机短信，向您的账号发即时信息、系统消息以及小铃铛信息通知，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。</p>
                        <p class="mt5">　　对于在洋葱OMALL平台上因交易活动引起的任何纠纷，您同意司法机关（包括但不限于人民法院）可以通过手机短信、系统信息通知等现代通讯方式或邮寄方式向您送达法律文书（包括但不限于诉讼文书）。您指定接收法律文书的手机号码、微信号等联系方式为您在洋葱OMALL平台注册、更新时提供的手机号码、电子邮箱联系方式以及在注册洋葱OMALL用户时生成洋葱账号，司法机关向上述联系方式发出法律文书即视为送达。您指定的邮寄地址为您的法定联系地址或您提供的有效联系地址。</p>
                        <p class="mt5">　　您同意司法机关可采取以上一种或多种送达方式向您达法律文书，司法机关采取多种方式向您送达法律文书，送达时间以上述送达方式中最先送达的为准。</p>
                        <p class="mt5">　　您同意上述送达方式适用于各个司法程序阶段。如进入诉讼程序的，包括但不限于一审、二审、再审、执行以及督促程序等。</p>
                        <p class="mt5">　　您应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，由您自行承担由此可能产生的法律后果。</p>
                        <p class="b f15 mt20 g3">第八条　协议的终止</p>
                        <p class="mt10 g3 b f14">8.1、终止的情形</p>
                       
                        <p class="mt10"><span class="b g3">【洋葱OMALL发起的终止】</span>出现以下情况时，洋葱OMALL可以本协议第八条的所列的方式通知您终止本协议：</p>
                        <p class="mt5">　　（一）、您违反本协议约定，洋葱OMALL依据违约条款终止本协议的；</p>
                        <p class="mt5">　　（二）、您盗用他人账户、发布违禁信息、骗取他人财物、售假、扰乱市场秩序、采取不正当手段谋利等行为，洋葱OMALL依据洋葱OMALL平台规则对您的账户予以查封的；</p>
                        <p class="mt5">　　（三）、除上述情形外，因您多次违反洋葱OMALL平台规则相关规定且情节严重，洋葱OMALL依据平台规则对您的账户予以查封的；</p>
                        <p class="mt5">　　（四）、您的账户被洋葱OMALL依据本协议回收的；</p>
                        <p class="mt5">　　（五）、您在洋葱OMALL平台有欺诈、发布或侵犯他人合法权益或其他严重违法违约行为的；</p>
                        <p class="mt5">　　（六）、其它应当终止服务的情况。</p>
                        <p class="b f15 mt20 g3">第九条　协议终止后的处理</p>
                        <p class="mt5"><span class="b g3">【用户信息披露】</span>本协议终止后，除法律有明确规定外，洋葱OMALL无义务向您或您指定的第三方披露您账户中的任何信息。</p>
                        <p class="mt5"><span class="b g3">【洋葱OMALL权利】</span>本协议终止后，洋葱OMALL仍享有下列权利：</p>
                        <p class="mt5">　　（一）继续保存您留存于洋葱OMALL平台的本协议第五条所列的各类信息；</p>
                        <p class="mt5">　　（二）对于您过往的违约行为，洋葱OMALL仍可依据本协议向您追究违约责任。</p>
                        <p class="mt5"><span class="b g3">【交易处理】</span>本协议终止后，对于您在本协议存续期间产生的交易订单，洋葱OMALL将联系您并根据您的意愿决定是否关闭该等交易订单；并承担因此产生的任何损失或增加的任何费用。</p>
                        <p class="b f15 mt20 g3">第十条　法律适用、管辖与其他</p>
                        <p class="mt5"><span class="b g3">【法律适用】</span>本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国大陆地区法律；如法律无相关规定的，参照商业惯例及/或行业惯例。</p>
                        <p class="mt5"><span class="b g3">【管辖】</span>您因使用洋葱OMALL平台服务所产生的争议，由洋葱OMALL与您协商解决。协商不成时，任何一方均可向被告所在地有管辖权的人民法院提起诉讼。</p>
                        <p class="mt5"><span class="b g3">【可分性】</span>本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。</p>
                    </div>
                </div>
            </div>
    <!--合约返回顶部-->
            <div id="gotop" class="gotop" style="z-index: 1000; position: fixed; bottom: 55px; right: 20px; display: block;" v-show="farAwaly>500" @click="backTop"></div>
        </div>

</template>
<script>
    import XheaderRgt from "../components/XheaderRgt.vue";
        export default {
            components: {
                XheaderRgt
            },
            data(){
                return {
                     farAwaly:0
                }
                
            },
            methods: {
                //返回顶部函数
                    backTop(){
                         var backTop = document.getElementById("gotop");
                      
                            backTop.timer = setInterval(()=>{
                            var currentTop = window.scrollY;
                            var speed = 200;
                            currentTop -=speed;
                            if(currentTop<=100){
                                speed=-10;
                            }
                            if(currentTop <=0){
                                clearInterval(backTop.timer);
                            }
                            window.scrollTo(0,currentTop);

                        },30)
                    },
                   
                //获取滚动条位置
                    showTool(){
                        this.farAwaly=document.documentElement.scrollTop || document.body.scrollTop;//谷歌不识别document.documentElement.scrollTop，必须要加上document.body.scrollTop；
                    },
            },
          mounted(){
                window.onscroll = this.showTool;//监听滚动条
             },
    }
</script>
<style scoped>
@import url("../assets/jeui.css");
@import url("../assets/newbase.css");
</style>